---
kind: type
id: T:Autodesk.Revit.DB.ResolutionTarget
source: html/3292e978-ddb2-0942-ee63-f783e7d15117.htm
---
# Autodesk.Revit.DB.ResolutionTarget

Indicates the resolution target(Screen or Printer) used for rendering settings.

## Syntax (C#)
```csharp
public enum ResolutionTarget
```